Revit 2027 API
View.GetPlacementOnSheetStatus Method
 Determines if this view placed on a sheet completely or partially.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ViewPlacementOnSheetStatus GetPlacementOnSheetStatus()
Public Function GetPlacementOnSheetStatus As ViewPlacementOnSheetStatus
public:
ViewPlacementOnSheetStatus GetPlacementOnSheetStatus()
member GetPlacementOnSheetStatus : unit -> ViewPlacementOnSheetStatus
Return Value
ViewPlacementOnSheetStatus
 A value indicating whether and how the View is placed on a Sheet.
Remarks
 Some Views can be placed on one or more Sheets completely or partially. For example, a Schedule divided in segments, and only some of them are placed on Sheets.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace